---
kind: type
id: T:Autodesk.Revit.DB.Visual.SolidglassBumpEnableType
source: html/885f2987-915e-d16f-0c24-10040202abf1.htm
---
# Autodesk.Revit.DB.Visual.SolidglassBumpEnableType

The enumerated type representing the permitted values for the asset property "SolidglassBumpEnable" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public enum SolidglassBumpEnableType
```